import 'dart:ui';

import 'package:flutter/material.dart';
import 'package:mutqen/resources/color_manager.dart';

import '../../../../data/model/result.dart';

List<resultdesc> resultdes= [
  resultdesc("صفاته المميزة",
      "يتميز هؤلاء الأفراد بالصفات التالية : التحليل ، الذحر ، الدقة ، النقد ، الفضول العلمي ، الاستقلالية في التفكير ، الذاتية (التفكير على مشاعره وأفكاره الذاتية) ، المنهجية ، العقلانية ، التحفظ.",
      "الامتلاك والاستحواذ ، حب المغامرة ، الطموح ، مهارات الإصغاء ، التسلط ، النشاط ، الإنطلاق ، الرافعية ، التفاؤل ، التفتيش عن المنفعة ، الثقة بالنفس",
      Icons.star),
  resultdesc("نظرته عن ذاته", "كصاحب شخصية مقنعة ، تمتلك المهارات التجارية والتسويقية أكثر من المهارات العلمية.","", Icons.person),
  resultdesc("نظرة الآخرين له", "يراه الآخرون أصحاب شخصية مليئة بالطاقة والحيوية ، لذا من الأفضل أن يتجنبوا العمل بالمجالات العلمية والفكرية المعقدة.",
      "",Icons.group),
  resultdesc("طبيعة العمل", "يحب العمل في مهن تستلزم العمل مع الآخرين ويستمتعون بأنشطة مثل البيع والإقناع والقيادة وإدارة الأداء","", Icons.work),
  resultdesc("المهن المناسبة", " علوم الحيوان - علوم الأحياء البحرية - العلوم النفسية - الفيزياء - الكيمياء - الجيولوجيا- الطب / الجراحة - الاقتصاد الاستهلاكي- المختبرات",
      "",Icons.workspaces),

];
List<result> results=[result("الشخصيه المحققه", "المفكر - المستقصي",30,ColorManager.primary,resultdes),
  result("الشخصيه الاجتماعيه", "المساعد",15,Colors.red,resultdes),
  result("الشخصيه المبادره", "المقنع",20,Colors.orange,resultdes),
  result("الشخصيه الواقعيه", "الواقعي",25,Colors.purple,resultdes),
  result("الشخصيه الفنيه", "الفنان",10,Colors.blue,resultdes)
];
