import 'dart:ui';

import 'package:flutter/material.dart';
import 'package:mutqen/resources/color_manager.dart';

import '../../../../data/model/result.dart';

List<resultdesc> disc_result_des= [
  resultdesc("مسيطرومباشر",
       "أبرز سماته",
       "يركز على النتائج \n يفضل الإقدام على الفعل بدلاً من التخطيط ، يحب مواجهة التحديات والإقدام على المخاطر ، سرعة في تقيم المواقف ويحدد مسار العمل اللازم لتخطيه ، حازم مباشر منافس ، لا يحب إضاعة الوقت ، يرغب دائما في الحصول على الإجابات المباشرة ' وضع الأمور في نصابها الصحيح '  عصاميون يتحدون الوضع الراهن ، يبرعون في موقع المسئولية ، لديهم ثقة فطرية بأنفسهم في تحقيق الأهداف الصعبة ",
       Icons.location_history_rounded,
  ),
  resultdesc("",
    "كيف يتواصل مع الآخرين",
    " *  ثقته بنفسه التي تماثل ثقة النسر\n *  يقف مستقيماً ويصافح بقوة ويحافظ على التواصل البصري مع الآخرين \n *  نبرة صوت حازمة ومباشرة \n *  تحدث بثقة مطلقة عند مشاركة الأفكار الجديدة \n *  يهتم بصلب الموضوع والإتقان \n *  يركز على النتيجة النهائية \n *  قد يفرضون على الآخرين أرائهم",
    Icons.accessibility_new_sharp,
  ),
  resultdesc("",
    "في بيئة العمل",
    "-> يبرع المسيطرون في بيئات العمل التي تقدر الأفكار الشاملة وذات مستويات تحمل المسئولية العالية التي تسعى إلى إنجاز الأمور\n-> يفضلون بيئات العمل التي تكون فيها الصراحة أمراً صحياً والخلافات البناءة مطلوبة  \n-> البيئة التي تشجع على المنافسة التي تخرج أفضل ما يملتكه المسيطرون \n-> البيئة التي تدعم اتخاذ القرارات السريعة والرغبة في السير في المسارات الغير المطروقة",
    Icons.accessibility_new_sharp,
  ),
  resultdesc("",
    "خطوات الوصول إلى أقصى قدراتك",
    "1- الأسلوب المباشر : قد ينظر البعض إلى الأسلوب المباشر أنه نوع من الوقاحة وعدم الإحساس بمشاعر الآخرين لذلك عليك طرح الميزيد من الأسئلة واجعل نبرة صوتك ناعمة\n  2- السرعة : عندما يتسرعون قد يتخذوا قرارات سيئة ويصبحون متهورين لذلك أبطئ من سرعة تفكيرك وفكر في الأمور بتأني \n 3- الطبيعة التفاعلية : خلال الأزمات يعالج الأمور من خلال تفكيره السريع ولكن ليست جميع المواقف طارئة لذلك تدربعلى الصبر وتوقع تأثير كلماتك وقراراتك على الآخرين \n 4- الدافع : يسعون إلى تحقيق النتائج و الإنجازات وقد يؤدي إلى ارتفاع التوتر لديهم لذلك اقض بعض الوقت في الاسترخاء والاستمتاع بثمار جهودك \n 5- الغرور  الثقة أمر جيد ولكن عند الإفراط تتحول إلى غرور لذلك لاحظ قدرات الآخرين ومساهماتهم فيما يدور حولك  \n 6- المكانة الكبيرة : يجسدون القوة والسلطة وقد يمنعون الآخرين من طرح الأفكار الجيدة  لذلك كن مدركاً للغة جسدك وابتسم وحافظ على التواصل البصري مع الآخرين",
    Icons.accessibility_new_sharp,
  ),



];
List<result> disc_results=[
  result("D", "مسيطر و مباشر و حازم",30,ColorManager.D,disc_result_des),
  result("I", "تفاعلي و ملهم و عفوي",20,ColorManager.I,disc_result_des),
  result("S", "داعم و مخلص ومتعاطف",25,ColorManager.S,disc_result_des),
  result("C", "وجداني و حذر و مستقيم",15,ColorManager.C,disc_result_des),


];
